package com.example.lyrics;

import androidx.annotation.NonNull;
import androidx.appcompat.app.AppCompatActivity;
import androidx.appcompat.widget.Toolbar;


import android.content.Intent;
import android.os.Bundle;
import android.view.Menu;
import android.view.MenuInflater;
import android.view.MenuItem;
import android.view.View;
import android.widget.Button;
import android.widget.ImageView;
import android.widget.TextView;

import com.github.barteksc.pdfviewer.PDFView;

public class PdfViewActivity extends AppCompatActivity {

    PDFView pdfView;
    TextView textView2,plus,minus;
    ImageView back;
    private TextView lyricsTextView; // Add this for displaying lyrics
    Button editButton;
    private Button shareButton;
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_pdf_view);
//        pdfView=findViewById(R.id.pdfView);
        textView2=findViewById(R.id.textView2);
        lyricsTextView=findViewById(R.id.lyricsTextView);
        back=findViewById(R.id.back);
        editButton=findViewById(R.id.editButton);
        shareButton = findViewById(R.id.shareButton);

        editButton=findViewById(R.id.editButton);
        Toolbar toolbar = findViewById(R.id.toolbar2);
        setSupportActionBar(toolbar);
        getSupportActionBar().setTitle("");
        lyricsTextView.setTextIsSelectable(true);

//        minus.setOnClickListener(new View.OnClickListener() {
//            @Override
//            public void onClick(View v) {
//                float currentTextSize = lyricsTextView.getTextSize();
//                float newSize = currentTextSize - 2; // Decrease by 2 pixels
//                lyricsTextView.setTextSize(TypedValue.COMPLEX_UNIT_PX, newSize);
//            }
//        });
//
//        plus.setOnClickListener(new View.OnClickListener() {
//            @Override
//            public void onClick(View v) {
//                float currentTextSize = lyricsTextView.getTextSize();
//                float newSize = currentTextSize + 2; // Increase by 2 pixels
//                lyricsTextView.setTextSize(TypedValue.COMPLEX_UNIT_PX, newSize);
//            }
//        });

















        shareButton.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                String textToShare = lyricsTextView.getText().toString();
                shareText(textToShare);
            }
        });


//        int position=getIntent().getIntExtra("position",0);
//        String song=getIntent().getStringExtra("name");
//        if (position == 0){
//            pdfView.fromAsset("ebir.pdf").load();
//            textView2.setText(song);
//        }
//       else if (position == 1){
//            pdfView.fromAsset("galtiya.pdf").load();
//            textView2.setText(song);
//        }
//        else if (position == 1){
//            pdfView.fromAsset("ebir.pdf").load();
//            textView2.setText(song);
//        }

        int position = getIntent().getIntExtra("position", 0);
        String song = getIntent().getStringExtra("name");
        String lyrics = getLyricsForPosition(position); // New method to get lyrics based on position

        textView2.setText(song);
        lyricsTextView.setText(lyrics);

        back.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                finish();
                Intent intent = new Intent(PdfViewActivity.this, MainActivity.class);
                startActivity(intent);
            }
        });
        // Set the edit button click listener
        editButton.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                String currentText = lyricsTextView.getText().toString();
                Intent intent = new Intent(PdfViewActivity.this, EditTextActivity.class);
                intent.putExtra("text", currentText);
                startActivityForResult(intent, 1); // 1 is the request code
            }
        });

    }

    @Override
    public boolean onCreateOptionsMenu(Menu menu) {
        MenuInflater inflater = getMenuInflater();
        inflater.inflate(R.menu.my_menu, menu); // Use your menu XML name here
        return true;
    }

    @Override
    public boolean onOptionsItemSelected(@NonNull MenuItem item) {
        switch (item.getItemId()) {
            case R.id.action_increase_text_size:
                TextIncrease();
                return true;
            case R.id.action_decrease_text_size:
                TextDecrease();
                return true;
            // Handle other menu items if any
            default:
                return super.onOptionsItemSelected(item);
        }
    }
    @Override
    protected void onActivityResult(int requestCode, int resultCode, Intent data) {
        super.onActivityResult(requestCode, resultCode, data);
        if (requestCode == 1 && resultCode == RESULT_OK) {
            String editedText = data.getStringExtra("editedText");
            lyricsTextView.setText(editedText);
        }
    }
    private void shareText(String text) {
        Intent shareIntent = new Intent();
        shareIntent.setAction(Intent.ACTION_SEND);
        shareIntent.setType("text/plain");
        shareIntent.putExtra(Intent.EXTRA_TEXT, text);
        startActivity(Intent.createChooser(shareIntent, "Share text via"));
    }
    private String getLyricsForPosition(int position) {
        switch (position) {
            case 0:
                return "አይሁድ ምልክት ይለምናሉ \n" +
                        "ግሪኮች ጥበብ ይሻሉ \n" +
                        "ጌታን ጥለው፡ ይቅበዘበዛሉ \n" +
                        "\n" +
                        "አዝ፦ እኛ ግን የሞተልንን \n" +
                        "በደሙም የተቤዥንን \n" +
                        "አዳኝነቱን ንጉሥነቱን \n" +
                        "ለፍጥረት ሁሉ እንሰብካለን \n" +
                        "አዎን እንሰብካለን (2x) \n" +
                        "\n" +
                        "ያልገባቸው ያላወቁት በድንቅ \n" +
                        "እንደ ሞኝነት ቢቆጥሩትም \n" +
                        "በመስቀሉ ቃል አናፍርበትም  \n" +
                        "\n" +
                        "አዝ፦ እኛ ግን የሞተልንን \n" +
                        "በደሙም የተቤዥንን \n" +
                        "አዳኝነቱን ንጉሥነቱን \n" +
                        "ለፍጥረት ሁሉ እንሰብካለን \n" +
                        "አዎን እንሰብካለን (2x) \n" +
                        "\n" +
                        "የመዳኑን ፀጋ መጠራቱን \n" +
                        "ከኃጢአን መሃል መውጣቱን \n" +
                        "ባይቀበሉትም እንኳን ወንጌሉን \n" +
                        "\n" +
                        "አዝ፦ እኛ ግን የሞተልንን \n" +
                        "በደሙም የተቤዥንን \n" +
                        "አዳኝነቱን ንጉሥነቱን \n" +
                        "ለፍጥረት ሁሉ እንሰብካለን \n" +
                        "አዎን እንሰብካለን (2x) \n" +
                        "\n" +
                        "ለእኛ ነህ መከታችን ኢየሱስ \n" +
                        "ከለላችንም ክርስቶስ \n" +
                        "አለቃችንም ነው የሰላም ንጉሥ \n" +
                        "\n" +
                        "አዝ፦ እኛ ግን የሞተልንን \n" +
                        "በደሙም የተቤዥንን \n" +
                        "አዳኝነቱን ንጉሥነቱን \n" +
                        "ለፍጥረት ሁሉ እንሰብካለን \n" +
                        "አዎን እንሰብካለን (2x) \n" +
                        "\n" +
                        "ባዶ ተስፋ ፍፁም አናወራም \n" +
                        "ከሥጋችን አንዘራም \n" +
                        "ጌታችን አለና አንፈራም \n" +
                        "\n" +
                        "አዝ፦ እኛ ግን የሞተልንን \n" +
                        "በደሙም የተቤዥንን \n" +
                        "አዳኝነቱን ንጉሥነቱን \n" +
                        "ለፍጥረት ሁሉ እንሰብካለን \n" +
                        "አዎን እንሰብካለን (2x) \n" +
                        "\n" +
                        "ለሚጠይቀን ሁሉ መልሳችን \n" +
                        "የቀራንዮ ወዳጃችን \n" +
                        "ኢየሱስ ጌታ ነው ትምክህታችን";
            case 1:
                return "የመከራዬ ጦሬ የማንጠርያዬ ቃል \n" +
                        "የመፈተኛ ቀን የመመዘኛ ቃል \n" +
                        "ነበር በጀግኖች ዘንድ በዓለቆች ጦረኞች \n" +
                        "በመንፈስ የድል ባለቤቶች \n" +
                        "\n" +
                        "አዝ፦ እኔም ያንን ፀጋ በሕይወቴ አድርጌ \n" +
                        "በችግሬ ሰዓት ጌታዬን ጠብቄ \n" +
                        "ልደርስ እወዳለሁ ወደዚያ ደረጃ \n" +
                        "በሚሰጠኝ ጉልበት በእምነት እርምጃ \n" +
                        "\n" +
                        "በቀደመው ትውልድ እሳት ነበር እኮ \n" +
                        "ለእምነት ትጋዳዮች መጣልን መረጡ \n" +
                        "ለማይጠፋው ቀን ሕያውም ተስፋ \n" +
                        "ተዋግተው አልፈዋል በትውልድ ነቀፋ \n" +
                        "\n" +
                        "አዝ፦ እኔም ያንን ፀጋ በሕይወቴ አድርጌ \n" +
                        "በችግሬ ሰዓት ጌታዬን ጠብቄ \n" +
                        "ልደርስ እወዳለሁ ወደዚያ ደረጃ \n" +
                        "በሚሰጠኝ ጉልበት በእምነት እርምጃ \n" +
                        "\n" +
                        "አምላካቸው ከብሯል በአምልኮ ስደት \n" +
                        "በትልቅ ተጋድሎ በወንጌል ደህነንት \n" +
                        "ከብረው አስከብረው የሕይወታቸውን ጌታ \n" +
                        "ሊገናኙት ወጡ ያንን ባለ ውለታ \n" +
                        "\n" +
                        "አዝ፦ እኔም ያንን ፀጋ በሕይወቴ አድርጌ \n" +
                        "በችግሬ ሰዓት ጌታዬን ጠብቄ \n" +
                        "ልደርስ እወዳለሁ ወደዚያ ደረጃ \n" +
                        "በሚሰጠኝ ጉልበት በእምነት እርምጃ \n" +
                        "\n" +
                        "እኛም ተጠርተናል ልንመልስ እነርሱን \n" +
                        "የመክራን እሳት እንድናየው ልኩን \n" +
                        "ስለዚህ ተጋደል የወንጌል አርበኛ \n" +
                        "ጌታም እንዲጥለው ያንተን ወደረኛ \n" +
                        "ነውና ድል የእኛ \n" +
                        "\n" +
                        "አዝ፦ እኔም ያንን ፀጋ በሕይወቴ አድርጌ \n" +
                        "በችግሬ ሰዓት ጌታዬን ጠብቄ \n" +
                        "ልደርስ እወዳለሁ ወደዚያ ደረጃ \n" +
                        "በሚሰጠኝ ጉልበት በእምነት እርምጃ";
            case 2:
                return "ከምድር በላይ ቢሆን ከሰማይ በታች \n" +
                        "መግባት መውጣታችሁ ዘወትር ተመልካች \n" +
                        "እንደ ኢየሱስ ያለ ማንን አገኛችሁ \n" +
                        "የሕይወት ዋስትና ጌታ የሚሆናችሁ \n" +
                        "\n" +
                        "አዝ፦ በእምነት እኖራለሁ ጌታዬን አውቃለሁ \n" +
                        "የኔን ፅኑ አምባ ተተግኘዋለሁ   \n" +
                        "ወጀቡን ሳልፈራ ታግዬ እወጣለሁ \n" +
                        "የክብር ሽልማቴን ከእጁ እረከባለሁ \n" +
                        "\n" +
                        "ለነገ አይጨንቀኝም ጭጋግ ቢሸፍነው \n" +
                        "ወይኑ ቢጠወልግ ሃሩሩ ቢያሰጋም \n" +
                        "ለእግሬ መብራት ነው ቃሉ በእጄ ያለው \n" +
                        "የተፈጥሮ አዛዥ ኢየሱስ ሕያው ነው \n" +
                        "\n" +
                        "አዝ፦ በእምነት እኖራለሁ ጌታዬን አውቃለሁ \n" +
                        "የኔን ፅኑ አምባ ተተግኘዋለሁ  \n" +
                        "ወጀቡን ሳልፈራ ታግዬ እወጣለሁ \n" +
                        "የክብር ሽልማቴን ከእጁ እረከባለሁ \n" +
                        "\n" +
                        "ፈቃዱ ሲሞላ ጌታዬ ከብሮ ሳይ \n" +
                        "ምድር ዕልል ብትል ሰማይ \n" +
                        "መስቀልህ አድርሰኝ እንጀራ ሌላ ነው \n" +
                        "ነፍሴ ትጠግባለች በክብር በጀርባህ \n" +
                        "\n" +
                        "አዝ፦ በእምነት እኖራለሁ ጌታዬን አውቃለሁ \n" +
                        "የኔን ፅኑ አምባ ተተግኘዋለሁ  \n" +
                        "ወጀቡን ሳልፈራ ታግዬ እወጣለሁ \n" +
                        "የክብር ሽልማቴን ከእጁ እረከባለሁ";
            case 3:
                return "ኃይልህን ቀምሸ ክንድህን አይቼ \n" +
                        "ክብርህ ተንሰራፍቶ በዓይኔ ተመልክቼ \n" +
                        "ያን ሁሉ ዘነጋሁ ዓለምን አይቼ \n" +
                        "እኔ ግን ተመከርኩ ከአንተ ተለይቼ \n" +
                        "\n" +
                        "አንተ ግን ጌታዬ ጠብቀኝ ልጅህን \n" +
                        "እግሬን ልትመልሰው ልትረዳኝ ፍጠን (2x) \n" +
                        "\n" +
                        "ፍቅርህ ግድ ይለኛል እንዳልለይህ \n" +
                        "ኮብልዬም ብጠፋ ከድሎት ደጅህ \n" +
                        "ከችጋሩ ሌላ ፀጋ ምህረትህ \n" +
                        "አያስጨክኑኝም ትዝታዎችህ \n" +
                        "\n" +
                        "ከቤትህ ሸሽቼ ወዴት እደርሳለሁ \n" +
                        "ከመንፈስህ ርቄ ወደማን እሄዳለሁ (2x) \n" +
                        "\n" +
                        "ምድሪቱ አንገላታኝ አላማዬን ስቼ \n" +
                        "ወደ ግራና ቀኝ ዓይኖቼን አንስቸ \n" +
                        "ኃጥዕ ሲለመልም ሲቀናው አይቼ \n" +
                        "ፍጻሜውን ሳላይ በሥራው ቀንቼ \n" +
                        "\n" +
                        "ፍሬ የለለው ከንቱ ለካስ ባዶ ኖሯል \n" +
                        "ግን የእኔው ደስታ ከዓለም ይልቃል (2x) \n" +
                        "\n" +
                        "ነፍሴ ተንገድግዳ ልትወድቅ ነበረ \n" +
                        "ግን ድጋፍ አገኘች ጠላቴም አፈረ \n" +
                        "የምን መታለል ነው ጉዳቴስ የቱ ነው \n" +
                        "ተደላድያለሁ ኢየሱስ በቀኝ ነው \n" +
                        "\n" +
                        "አረጋግጦልኛል ጌታ እንደማይተወኝ \n" +
                        "ጠላት ተስፋ ቁረጥ አትችልም ልትጥለኝ (2x)";
            case 4:
                return "በባቢሎን ወንዞች ማዶ አዝነን ተቀምጠን \n" +
                        "ጽዮንን ባሰብናት ጊዜ እጅግ አለቀስን \n" +
                        "የመጽናናት አምላክ ከላይ ግን ያየናል \n" +
                        "እንባችንን ጠርጐ ስብራታችንን ይጠግንልናል \n" +
                        "\n" +
                        "አዝ፦ ምህረቱ አያልቅምና \n" +
                        "ለዘለዓለም ቸር ነውና \n" +
                        "የማዳን ኃይሉን ላሳየን \n" +
                        "በክንዱ ለሚጐበኘን \n" +
                        "መልካሙን መዓዛ በምሥጋና አቅርቡለት \n" +
                        "በዕልልታ ስገዱለት \n" +
                        "\n" +
                        "የችግረኞችን ጩኸት ሰምቶ አይጨክንም \n" +
                        "ምርጦቹን ኧረ በፍፁም አያስጨንቅም \n" +
                        "ጠላታቸው ሊበትን በነጐድጓድ አንቀጥቅጦ \n" +
                        "ረድኤታቸው ከተፍ ይላል ከጸባኦት በግርማው ተገልጦ \n" +
                        "\n" +
                        "አዝ፦ ምህረቱ አያልቅምና \n" +
                        "ለዘለዓለም ቸር ነውና \n" +
                        "የማዳን ኃይሉን ላሳየን \n" +
                        "በክንዱ ለሚጐበኘን \n" +
                        "መልካሙን መዓዛ በምሥጋና አቅርቡለት \n" +
                        "በዕልልታ ስገዱለት \n" +
                        "\n" +
                        "በሥጋዎቻቸው የገነኑ ፈፅመው ሲወድቁ \n" +
                        "እግዚአብሔርን በመታመን የሚጠባበቁ \n" +
                        "በእንባቸው ፍሬ እያሸበርቁ \n" +
                        "በክንፍ ይወጣሉ ይሮጣሉ ይገባሉ እንደ ዕንቁ \n" +
                        "\n" +
                        "አዝ፦ ምህረቱ አያልቅምና \n" +
                        "ለዘለዓለም ቸር ነውና \n" +
                        "የማዳን ኃይሉን ላሳየን \n" +
                        "በክንዱ ለሚጐበኘን \n" +
                        "መልካሙን መዓዛ በምሥጋና አቅርቡለት \n" +
                        "በዕልልታ ስገዱለት \n" +
                        "\n" +
                        "ለእኛ መጠጊያችን ጌታ እግዚአብሔራችን \n" +
                        "በምንም አንፈራም እርሱ ኃይላችን \n" +
                        "ከሰይጣን አሰራር ሥሙ ይጠብቀናል \n" +
                        "ለአሞራም ሳይሰጠን በክንፎቹ አዝሎ ቤቱ ያገባናል \n" +
                        "\n" +
                        "አዝ፦ ምህረቱ አያልቅምና \n" +
                        "ለዘለዓለም ቸር ነውና \n" +
                        "የማዳን ኃይሉን ላሳየን \n" +
                        "በክንዱ ለሚጐበኘን \n" +
                        "መልካሙን መዓዛ በምሥጋና አቅርቡለት \n" +
                        "በዕልልታ ስገዱለት (2x)";
            case 5:
                return "ዓላማ ይዞ የተሰለፈ የሚያስፈራም የአንተ ሠራዊት \n" +
                        "ጠላትን ሁሉ እያሸነፈ በአንተ መሪነት ቀንና ሌሊት \n" +
                        "ባሕር ተሻግሮ በምድረበዳ ጊንጡን ረጋግጦ \n" +
                        "ጥቂቱ ሕዝብህ ከአንተ ጋር በዝቶ ርስቱን ጨበጠ ከብዙ በልጦ \n" +
                        "\n" +
                        "አዝ፦ ሕዝብን አበዛህ (2x) \n" +
                        "የአገሪቱንም ወሰን አሰፋህ \n" +
                        "የማዳን እጅን ለእኛ ዘረጋህ (2x) \n" +
                        "\n" +
                        "የሰናፍጯን ቅንጣት ቢዘራ ጌታ በምድር እንድትበዛ \n" +
                        "ያ ጉልበተኛው መጥቶ ረገጣት እንዳትበቅል መስላው ፈዛዛ \n" +
                        "ግን አልተሳካም አምልጣው ወጣች ሄደች አደገች \n" +
                        "ጌታ ይመስገን ድንበሯ ሰፋ ለደካከሙት መጠለያ ሆነች \n" +
                        "\n" +
                        "አዝ፦ ሕዝብን አበዛህ (2x) \n" +
                        "የአገሪቱንም ወሰን አሰፋህ \n" +
                        "የማዳን እጅን ለእኛ ዘረጋህ (2x) \n" +
                        "\n" +
                        "ኦ ሃሌሉያ ሃሌ ሃሌሉያ እያሸነፈ ዘለዓለም ነዋሪ \n" +
                        "እንደ አምላካችን ያለ ታዳጊ ከቶ የት አለ ተወዳዳሪ \n" +
                        "ጩኸትን ሰምቶ ምስኪን ድሆችን ዘይት የሚቀባ \n" +
                        "በአደባባዩ በቤቱ ተክሎ የሚያለመልም እንደ ዘንባባ \n" +
                        "\n" +
                        "አዝ፦ ሕዝብን አበዛህ (2x) \n" +
                        "የአገሪቱንም ወሰን አሰፋህ \n" +
                        "የማዳን እጅን ለእኛ ዘረጋህ (2x) \n" +
                        "\n" +
                        "ኦ ሃሌሉያ ሃሌ ሃሌሉያ እያሸነፈ ዘለዓለም ነዋሪ \n" +
                        "እንደ አምላካችን ያለ ታዳጊ ከቶ የት አለ ተወዳዳሪ \n" +
                        "ጩኸትን ሰምቶ ምስኪን ድሆችን ዘይት የሚቀባ \n" +
                        "በአደባባዩ በቤቱ ተክሎ የሚያለመልም እንደ ዘንባባ \n" +
                        "\n" +
                        "አዝ፦ ሕዝብን አበዛህ (2x) \n" +
                        "የአገሪቱንም ወሰን አሰፋህ \n" +
                        "የማዳን እጅን ለእኛ ዘረጋህ (2x)";
            case 6:
                return "አዝ፦ ኦ ክብር (4x) ሃሌሉያ \n" +
                        "ለይሁዳ ነገድ ለሆንከው አንበሳ ለሌለው አምሳያ \n" +
                        "ልበል ላመሥግነው ከአንጀቴ \n" +
                        "ውለታው ስለበዛ የመድኃኒቴ \n" +
                        "\n" +
                        "ሳላውቀው ያወቀኝ ሳልሻው ያዳነኝ \n" +
                        "በአስገራሚ ፍቅሩ እኔን የወደደኝ \n" +
                        "ከጥፋት ሩጫ ነፍሴን የመለሳት \n" +
                        "ኢየሱስ ነውና ያወጣኝ ከእሳት \n" +
                        "\n" +
                        "አዝ፦ ኦ ክብር (4x) ሃሌሉያ \n" +
                        "ለይሁዳ ነገድ ለሆንከው አንበሳ ለሌለው አምሳያ \n" +
                        "ልበል ላመሥግነው ከአንጀቴ \n" +
                        "ውለታው ስለበዛ የመድኃኒቴ \n" +
                        "\n" +
                        "በልጅነቴ ጊዜ ያኔ በለጋነት \n" +
                        "ጠላት ሲጐትተኝ ወደዚያ ባርነት \n" +
                        "ፀጋው ባይበዛልኝ እጁ ባይደግፈኝ \n" +
                        "የት ቦታ ነበርኩኝ ክንፉ ባይጋርደኝ \n" +
                        "\n" +
                        "አዝ፦ ኦ ክብር (4x) ሃሌሉያ \n" +
                        "ለይሁዳ ነገድ ለሆንከው አንበሳ ለሌለው አምሳያ \n" +
                        "ልበል ላመሥግነው ከአንጀቴ \n" +
                        "ውለታው ስለበዛ የመድኃኒቴ \n" +
                        "\n" +
                        "ጥሩር ሆኖልኛል በጦርነት ጊዜ \n" +
                        "ፍላጻ ሲያቆስለኝ በሃዘን በትካዜ \n" +
                        "ውለታውን እያሰብኩ ላመሥግነው ጌታን \n" +
                        "አይገኝምና እንደ እርሱ የሚረዳኝ \n" +
                        "\n" +
                        "አዝ፦ ኦ ክብር (4x) ሃሌሉያ \n" +
                        "ለይሁዳ ነገድ ለሆንከው አንበሳ ለሌለው አምሳያ \n" +
                        "ልበል ላመሥግነው ከአንጀቴ \n" +
                        "ውለታው ስለበዛ የመድኃኒቴ (2x)";
            case 7:
                return "የፈርዖን ገንዘብ ያልማረከው ጀግና \n" +
                        "ዓይኑ ያልደከመ ያላለቀ ገና \n" +
                        "ድል ለማድረግ ወጣ በጦርነት ሲቃ \n" +
                        "በጀርባው አንግቦ የአምላኩን ጦር ዕቃ (2x) \n" +
                        "\n" +
                        "የወይኒው አስራት የግርፋት ብዛት \n" +
                        "አልቻለው ሊያበርደው የፍቅሩን ትኩሳት \n" +
                        "ፎከረ ያ ጐበዝ ሊጥል ሊገረስስ \n" +
                        "ጠምዶ በቀኝ እጁ የቃሉን መትረየስ (2x) \n" +
                        "\n" +
                        "ገና ዓይኑ ፍጦ ትኩር ብሎ እያየ \n" +
                        "የጠላትን ምሽግ ቅጥሩን አጋዬ \n" +
                        "የአርያም እሳት በኃይል ጐብኝቶታል \n" +
                        "እባቡና ጊንጡን ከእግሩ ስር ረግጦታል (2x) \n" +
                        "\n" +
                        "በድካም በረታ ጅማቱ ጠንክሯል \n" +
                        "አንገብግቦት ፍቅሩ ወኔው ተቀስቅሷል \n" +
                        "በጀርባው መተልተል ጌታን አከበረ \n" +
                        "የሞትንም ባሕር በእምነት ተሻገረ (2x";
            case 8:
                return "ገና ህጻን ሳለህ ስጠነቀቅልህ \n" +
                        "ክንዶችህን ይዤ ዳዴ ሳስተምርህ \n" +
                        "መራመድን ችለህ ሩጫውን አጠናቅቀህ \n" +
                        "እንዳልገሰገስክ ዛሬ ግን ታከተህ \n" +
                        "\n" +
                        "አዝ፦ ከሸካራው መንገድ እግርህን መልሰው \n" +
                        "አይበጅህምና ደሜን አትርገጠው \n" +
                        "ይልቅ እንታረቅ ምህረቴ ብዙ ነው \n" +
                        "\n" +
                        "በሃሩርር ተቃጥለህ በጥም ተመትተሃል \n" +
                        "ፍሬህ ሁሉ ደርቆ ፍሬ ቢስ ሆነሃል \n" +
                        "መንፈሳዊነትህ አሁን ከአንተ ርቆ \n" +
                        "ለስጋ ተገዛህ ፀጋህ ሁሉ አልቆ \n" +
                        "\n" +
                        "አዝ፦ ከሸካራው መንገድ እግርህን መልሰው \n" +
                        "አይበጅህምና ደሜን አትርገጠው \n" +
                        "ይልቅ እንታረቅ ምህረቴ ብዙ ነው \n" +
                        "  \n" +
                        "ከግብጽም ጀምሬ እኔ አምላክህ ነህ \n" +
                        "በደሜ የዋጀሁህ ተው አታሳዝነኝ \n" +
                        "ምህረት እንደምወድ ጸባዬን ተውቃለህ \n" +
                        "እልሁን ተውና ታረቀኝ ልጄ ነህ \n" +
                        "\n" +
                        "አዝ፦ ከሸካራው መንገድ እግርህን መልሰው \n" +
                        "አይበጅህምና ደሜን አትርገጠው \n" +
                        "ይልቅ እንታረቅ ምህረቴ ብዙ ነው \n" +
                        "\n" +
                        "ምህረት ተነስታለች ልቤ ተናውጣለች \n" +
                        "እጄ ተዘርግታ ገና ትኖራለች \n" +
                        "የፍቅር ቀንበሬን ናና ልጫንብህ \n" +
                        "ጫንቃህንም ስጠኝ ላድንህ . (1) . \n" +
                        "\n" +
                        "አዝ፦ ከሸካራው መንገድ እግርህን መልሰው \n" +
                        "አይበጅህምና ደሜን አትርገጠው \n" +
                        "ይልቅ እንታረቅ ምህረቴ ብዙ ነው";
            case 9:
                return "በከንቱ ሮጠህ ጉልበትህ ባክኖ ጨርሶ አልቆ \n" +
                        "በኃጢያት ሸክም ነፍሽ መንምና አጥንትህ ደርቆ \n" +
                        "መድረሻህ ጠፍቶብህ ግራ ተብቶህ የምትባዝን \n" +
                        "የዓለምን ቤዛ ቀርበህ አማክረው ጌታ ኢየሱስን \n" +
                        "\n" +
                        "አዝ፦ የባዘንከው ውድ ወንድሜ \n" +
                        "አዳምጠኝ እስኪ ልምከርህ ደግሜ \n" +
                        "ወደ ነፍስህ እረኛና ጠባቂ ና ተመለስ \n" +
                        "\n" +
                        "ያለማወቅን ወራት ዘመናት እና ዓመታትን \n" +
                        "ከኢየሱስ ወዲያ እርካታ ላይገኝ እንዲያው ስታልም \n" +
                        "በዓለም የሚያንፅ ከቶ አይገኝም ምን ይሻልሃል \n" +
                        "ድንቁ ኢየሱስን ተቀበለው ያረካሃል \n" +
                        "\n" +
                        "አዝ፦ የባዘንከው ውድ ወንድሜ \n" +
                        "አዳምጠኝ እስኪ ልምከርህ ደግሜ \n" +
                        "ወደ ነፍስህ እረኛና ጠባቂ ና ተመለስ \n" +
                        "\n" +
                        "ዕውቀትን አጥተህ በዚች ዓለም ላይ የተንከራተትክ \n" +
                        "በጨለማው ደጅ በዲያቢሎስ እጅ የተማረክ \n" +
                        "ምርኮን . (1) . ከላይ ከሰማይ የወረደው \n" +
                        "የምስራቹን ትፈልታለህ አማኑኤል ነው \n" +
                        "\n" +
                        "አዝ፦ የባዘንከው ውድ ወንድሜ \n" +
                        "አዳምጠኝ እስኪ ልምከርህ ደግሜ \n" +
                        "ወደ ነፍስህ እረኛና ጠባቂ ና ተመለስ (2x)";
            case 10:
                return "አዝ፦ ፍቅር ፍቅር ፍቅር ነው የጐደለኝ \n" +
                        "በደልን የምቆጥር ነኝ \n" +
                        "ጌታ ይቅር ባይ አድርገኝ \n" +
                        "መራራ ሥሬን ቁረጥልኝ \n" +
                        "በአንተው ፍቅር የጣፈጠ ሕይወት ስጠኝ \n" +
                        "\n" +
                        "ትንቢትና ዕውቀት መገለጥ ቢኖረኝ \n" +
                        "ተራራን የሚያፈርስ ዕምነት ሁሉ ባገኝ \n" +
                        "በሰዎች በመላዕክት ልሳን ብናገርም \n" +
                        "ፍቅር ግን ከሌለኝ ምንም አይጠቅመኝም \n" +
                        "\n" +
                        "አዝ፦ ፍቅር ፍቅር ፍቅር ነው የጐደለኝ \n" +
                        "በደልን የምቆጥር ነኝ \n" +
                        "ጌታ ይቅር ባይ አድርገኝ \n" +
                        "መራራ ሥሬን ቁረጥልኝ \n" +
                        "በአንተው ፍቅር የጣፈጠ ሕይወት ስጠኝ \n" +
                        "\n" +
                        "ፍቅር ይታገሳል   ቸርነት ያደርጋል \n" +
                        "በዕውነት ደስ ይለዋል   ዓመጽን ይጠላል \n" +
                        "አይቀናም   አይመካም   ራሱን ያዋርዳል \n" +
                        "እየተበደለ ሁሉን ይቅር ይላል \n" +
                        "\n" +
                        "አዝ፦ ፍቅር ፍቅር ፍቅር ነው የጐደለኝ \n" +
                        "በደልን የምቆጥር ነኝ \n" +
                        "ጌታ ይቅር ባይ አድርገኝ \n" +
                        "መራራ ሥሬን ቁረጥልኝ \n" +
                        "በአንተው ፍቅር የጣፈጠ ሕይወት ስጠኝ \n" +
                        "\n" +
                        "በአመቺ ቦታ ላይ ጠላቱን አግኝቶ \n" +
                        "በመልካሙመንገድ በፍቅር ሸኝቶ \n" +
                        "በሰላም የሚሰድ ከሰው ልጆች ማነው? \n" +
                        "ዳዊት በዘመኑ ይህን አደረገው \n" +
                        "\n" +
                        "አዝ፦ ፍቅር ፍቅር ፍቅር ነው የጐደለኝ \n" +
                        "በደልን የምቆጥር ነኝ \n" +
                        "ጌታ ይቅር ባይ አድርገኝ \n" +
                        "መራራ ሥሬን ቁረጥልኝ \n" +
                        "በአንተው ፍቅር የጣፈጠ ሕይወት ስጠኝ \n" +
                        "\n" +
                        "ጠላቶችህ ሳለን ሞትህ ካስታረቀን \n" +
                        "በመስቀል ላይ ፍቅርህ ሕይወት ከሰጠኸን \n" +
                        "ሕይወት እንድናተርፍ ሰውን ሁሉ ወድደን \n" +
                        "በዕውነተኛው ፍቅር ጌታ አጥለቅልቀን \n" +
                        "\n" +
                        "አዝ፦ ፍቅር ፍቅር ፍቅር ነው የጐደለኝ \n" +
                        "በደልን የምቆጥር ነኝ \n" +
                        "ጌታ ይቅር ባይ አድርገኝ \n" +
                        "መራራ ሥሬን ቁረጥልኝ \n" +
                        "በአንተው ፍቅር የጣፈጠ ሕይወት ስጠኝ";
            case 11:
                return "አዝ፦ ማደሪያዎችህ እንደ ምን የተወደዱ ናቸው \n" +
                        "በቅዱስ ቃልህ በመንፈስህ የቀደስካቸው \n" +
                        "ጌታዬ ሆይ! በመቅደስህ ከፍ ባለውም ዙፋንህ \n" +
                        "ስግደት ይቅረብልህ  ስግደት ይቅረብልህ \n" +
                        "\n" +
                        "ክቡር ድንጋዮች ሕያዋን ልጆች \n" +
                        "በበጉ ደም የተዋጁ ሰዎች \n" +
                        "ቤተ መቅደስ ለመሆን ታነጹ \n" +
                        "ማደሪያ ሆኑለት ለንጉሡ \n" +
                        "\n" +
                        "አዝ፦ ማደሪያዎችህ እንደ ምን የተወደዱ ናቸው \n" +
                        "በቅዱስ ቃልህ በመንፈስህ የቀደስካቸው \n" +
                        "ጌታዬ ሆይ! በመቅደስህ ከፍ ባለውም ዙፋንህ \n" +
                        "ስግደት ይቅረብልህ  ስግደት ይቅረብልህ \n" +
                        "\n" +
                        "በዓለም አዕላፍ ዕርካታን ያጡ \n" +
                        "ዝናህን ሰምተው ከሩቅ የመጡ \n" +
                        "በኃጥአን ድንኳን ከሚቀመጡ \n" +
                        "በአንተ ማደሪያ መጣል መረጡ \n" +
                        "\n" +
                        "አዝ፦ ማደሪያዎችህ እንደ ምን የተወደዱ ናቸው \n" +
                        "በቅዱስ ቃልህ በመንፈስህ የቀደስካቸው \n" +
                        "ጌታዬ ሆይ! በመቅደስህ ከፍ ባለውም ዙፋንህ \n" +
                        "ስግደት ይቅረብልህ  ስግደት ይቅረብልህ \n" +
                        "\n" +
                        "በጓዳዎችህ ክቡር ነገሮች \n" +
                        "ተከምረዋል የሰማይ ሃብቶች \n" +
                        "በመብራት በዘይትህም ቅባቶች \n" +
                        "እጅግ ደመቁ የአንተ ልጆች \n" +
                        "\n" +
                        "አዝ፦ ማደሪያዎችህ እንደ ምን የተወደዱ ናቸው \n" +
                        "በቅዱስ ቃልህ በመንፈስህ የቀደስካቸው \n" +
                        "ጌታዬ ሆይ! በመቅደስህ ከፍ ባለውም ዙፋንህ \n" +
                        "ስግደት ይቅረብልህ  ስግደት ይቅረብልህ \n" +
                        "\n" +
                        "ካህናቶችህ በመለከቶች \n" +
                        "መዘምራን በዜማ ዕቃዎች \n" +
                        "ባንድነት ቃና ወጣ ድምጻቸው \n" +
                        "ከፍ አደረጉህ በምሥጋናቸው \n" +
                        "\n" +
                        "አዝ፦ ማደሪያዎችህ እንደ ምን የተወደዱ ናቸው \n" +
                        "በቅዱስ ቃልህ በመንፈስህ የቀደስካቸው \n" +
                        "ጌታዬ ሆይ! በመቅደስህ ከፍ ባለውም ዙፋንህ \n" +
                        "ስግደት ይቅረብልህ  ስግደት ይቅረብልህ \n" +
                        "\n" +
                        "በዘለዓለማዊው ምሕረቱ \n" +
                        "ልኡል ጐበኘን በቸርነቱ \n" +
                        "ጌታ ለሕዝቡ ሰጠ ሞገሱን \n" +
                        "የአምላኬ ክብር ሞላ መቅደሱን \n" +
                        "\n" +
                        "አዝ፦ ማደሪያዎችህ እንደ ምን የተወደዱ ናቸው \n" +
                        "በቅዱስ ቃልህ በመንፈስህ የቀደስካቸው \n" +
                        "ጌታዬ ሆይ! በመቅደስህ ከፍ ባለውም ዙፋንህ \n" +
                        "ስግደት ይቅረብልህ  ስግደት ይቅረብልህ";
            case 12:
                return "አዝ፦ ቤዛ የሆንክልኝ ጌታዬ \n" +
                        "የሕይወቴ መልሕቅ ድጋፍ የዕርምጃዬ \n" +
                        "ማዳንህ ተገልጾ አይቻለሁ ጽድቅህን \n" +
                        "ስለዚህ በደስታ ላመስግን ስምህን (2x) \n" +
                        "\n" +
                        "በወርቅ ይሁን በብር   በጥበብ   በዕውቀት \n" +
                        "የዳነ ማን አለ ከኃጢአት ውድቀት? \n" +
                        "ጌታ ሆይ ! አንተ ነህ ጽድቅን ያለበስኸኝ \n" +
                        "በምሕረት አማልደህ ከዓብ ያስታረቅኸኝ (2x) \n" +
                        "\n" +
                        "አዝ፦ ቤዛ የሆንክልኝ ጌታዬ \n" +
                        "የሕይወቴ መልሕቅ ድጋፍ የዕርምጃዬ \n" +
                        "ማዳንህ ተገልጾ አይቻለሁ ጽድቅህን \n" +
                        "ስለዚህ በደስታ ላመስግን ስምህን (2x) \n" +
                        "\n" +
                        "በክርስቶስ ኢየሱስ የመስቀል ላይ ሥራ \n" +
                        "ከዘለዓለም ሞት ዳንኩኝ ከመከራ \n" +
                        "በነጻ ታድዬ የጽድቅን ሥጦታ \n" +
                        "ምሥጋና እሰዋለሁ ለተቤዠኝ ጌታ (2x) \n" +
                        "\n" +
                        "አዝ፦ ቤዛ የሆንክልኝ ጌታዬ \n" +
                        "የሕይወቴ መልሕቅ ድጋፍ የዕርምጃዬ \n" +
                        "ማዳንህ ተገልጾ አይቻለሁ ጽድቅህን \n" +
                        "ስለዚህ በደስታ ላመስግን ስምህን (2x) \n" +
                        "\n" +
                        "ብላቴንነቴን   ድካሜን ገምተህ \n" +
                        "አንተ ብርቱ ጌታ በእኔ ላይ ተገልጠህ \n" +
                        "የበረታብኝን ጠላቴን ቀጥቅጠህ \n" +
                        "ድል ያጐናተጸፍኸኝ ኢየሱስ አንተ ነህ (2x) \n" +
                        "\n" +
                        "አዝ፦ ቤዛ የሆንክልኝ ጌታዬ \n" +
                        "የሕይወቴ መልሕቅ ድጋፍ የዕርምጃዬ \n" +
                        "ማዳንህ ተገልጾ አይቻለሁ ጽድቅህን \n" +
                        "ስለዚህ በደስታ ላመስግን ስምህን (2x) \n" +
                        "\n" +
                        "መልካሙን ሥራህን በሕይወቴ ፈጽመህ \n" +
                        "እንድትታይብኝ በኑሮዬ ጐልተህ \n" +
                        "ይህ ነው ልመናዬ የዘወትር ጸሎቴ \n" +
                        "ክብሬ   ዕርካታዬ   አንተ ነህ ትምክህቴ (2x) \n" +
                        "\n" +
                        "አዝ፦ ቤዛ የሆንክልኝ ጌታዬ \n" +
                        "የሕይወቴ መልሕቅ ድጋፍ የዕርምጃዬ \n" +
                        "ማዳንህ ተገልጾ አይቻለሁ ጽድቅህን \n" +
                        "ስለዚህ በደስታ ላመስግን ስምህን (2x)";
            case 13:
                return "አዝ፦ ያይሃል   ያይሃል   ያይሃል   ያይሃል  \n" +
                        "ያይሃል   ኢየሱስ ያይሃል  \n" +
                        "ያይሃል   በዕውነት ያይሃል  \n" +
                        "የአንተ ነገር ይገደዋል \n" +
                        "ሊታደግህም ይመጣል \n" +
                        "\n" +
                        "በምድረ በዳ ያለኸው \n" +
                        "እንደ አጋር ያነባኸው \n" +
                        "የሚያይህንስ ብታየው \n" +
                        "ፍጻሜህማ ተስፋ አለው \n" +
                        "\n" +
                        "አዝ፦ ያይሃል   ያይሃል   ያይሃል   ያይሃል  \n" +
                        "ያይሃል   ኢየሱስ ያይሃል  \n" +
                        "ያይሃል   በዕውነት ያይሃል  \n" +
                        "የአንተ ነገር ይገደዋል \n" +
                        "ሊታደግህም ይመጣል \n" +
                        "\n" +
                        "ኑሮ ቢመሳቀልብህ \n" +
                        "የያዝኸው ቢበተንብህ \n" +
                        "ጌታም የተወህ ሲመስልህ \n" +
                        "ጠላትህ ሲዘብትብህ \n" +
                        "\n" +
                        "አዝ፦ ያይሃል   ያይሃል   ያይሃል   ያይሃል  \n" +
                        "ያይሃል   ኢየሱስ ያይሃል  \n" +
                        "ያይሃል   በዕውነት ያይሃል  \n" +
                        "የአንተ ነገር ይገደዋል \n" +
                        "ሊታደግህም ይመጣል \n" +
                        "\n" +
                        "ልብህ ሲያዝን ሲተክዝ \n" +
                        "ለሕይወትህ ጽኑ ምርኩዝ \n" +
                        "አይዞህ ባይ የሚያበረታ \n" +
                        "ከቶ ማን አለ እንደ ጌታ? \n" +
                        "\n" +
                        "አዝ፦ ያይሃል   ያይሃል   ያይሃል   ያይሃል  \n" +
                        "ያይሃል   ኢየሱስ ያይሃል  \n" +
                        "ያይሃል   በዕውነት ያይሃል  \n" +
                        "የአንተ ነገር ይገደዋል \n" +
                        "ሊታደግህም ይመጣል \n" +
                        "\n" +
                        "ሸክምን የሚያራግፍ ጌታ \n" +
                        "የችግረኞች መከታ \n" +
                        "ታማኝ የበጐች እረኛ \n" +
                        "አማኑኤል አለን ለእኛ \n" +
                        "\n" +
                        "አዝ፦ ያይሃል   ያይሃል   ያይሃል   ያይሃል  \n" +
                        "ያይሃል   ኢየሱስ ያይሃል  \n" +
                        "ያይሃል   በዕውነት ያይሃል  \n" +
                        "የአንተ ነገር ይገደዋል \n" +
                        "ሊታደግህም ይመጣል \n" +
                        "\n" +
                        "ያይሃል   ኢየሱስ ያይሃል \n" +
                        "ያይሻል   ኢየሱስ ያይሻል \n" +
                        "ያየናል   ኢየሱስ ያየናል";
            case 14:
                return "አዝ፦ እታገላለሁ   እታገላለሁ \n" +
                        "እስከ መጨረሻው እታገላለሁ \n" +
                        "የእስራኤል አምላክ ድል እንደሚሰጠኝ እምናለሁ \n" +
                        "\n" +
                        "ጉልበቴን አጠንክሬ ክንዶቼን አበርትቼ \n" +
                        "እጓዛለሁ በደስታ ሳይከፋኝ ተፅናንቼ \n" +
                        "\n" +
                        "አዝ፦ እታገላለሁ   እታገላለሁ \n" +
                        "እስከ መጨረሻው እታገላለሁ \n" +
                        "የእስራኤል አምላክ ድል እንደሚሰጠኝ እምናለሁ \n" +
                        "\n" +
                        "የሰላምን ወንጌል በእግሬ ተጫምቼ \n" +
                        "በክንፉ ተማምኜ በደሙም ተሸፍኜ \n" +
                        "\n" +
                        "አዝ፦ እታገላለሁ   እታገላለሁ \n" +
                        "እስከ መጨረሻው እታገላለሁ \n" +
                        "የእስራኤል አምላክ ድል እንደሚሰጠኝ እምናለሁ \n" +
                        "\n" +
                        "ፍላጻ የማይበሳውን ጥሩሩን እልብሳለሁ \n" +
                        "ሕይወቴን ላላስድፍር በተጠንቀቅ ቆማለሁ \n" +
                        "\n" +
                        "አዝ፦ እታገላለሁ   እታገላለሁ \n" +
                        "እስከ መጨረሻው እታገላለሁ \n" +
                        "የእስራኤል አምላክ ድል እንደሚሰጠኝ እምናለሁ \n" +
                        "\n" +
                        "እምነት ጋሻቸው ሆኖ ቅዱሳን ከተጓዙ \n" +
                        "ኑሯቸው ከተቃና ድልን ከተቀዳጁ \n" +
                        "\n" +
                        "አዝ፦ እታገላለሁ   እታገላለሁ \n" +
                        "እስከ መጨረሻው እታገላለሁ \n" +
                        "የእስራኤል አምላክ ድል እንደሚሰጠኝ እምናለሁ \n" +
                        "\n" +
                        "በመታገል ከሆነ ማሸነፍ ድል መንሳት \n" +
                        "ከዚህ ዓለም ገዢ ጋራ ከክፋትም ሠራዊት \n" +
                        "\n" +
                        "አዝ፦ እታገላለሁ   እታገላለሁ \n" +
                        "እስከ መጨረሻው እታገላለሁ \n" +
                        "የእስራኤል አምላክ ድል እንደሚሰጠኝ እምናለሁ \n" +
                        "\n" +
                        "የተዘጋጀልኝን ከኢየሱስ ከጌታዬ \n" +
                        "እወስዳለሁ አክሊሌን በሚገባ ታግዬ \n" +
                        "\n" +
                        "አዝ፦ እታገላለሁ   እታገላለሁ \n" +
                        "እስከ መጨረሻው እታገላለሁ \n" +
                        "የእስራኤል አምላክ ድል እንደሚሰጠኝ እምናለሁ";
            case 15:
                return "አዝ፦ ምሥጋና የሚገባውን \n" +
                        "እግዚአብሔርን እጠራለሁ \n" +
                        "ከጠላቶቼም እድናለሁ (2x) \n" +
                        "\n" +
                        "የአመጽ ፈሳሽ ሲያስፈራራኝ የሲዖል ጣርም ሲከበኝ \n" +
                        "አምላክህ የታለ ሲለኝ ባላኝጣዬ ሲያፌዝብኝ \n" +
                        "ከመሠረቴ ሊነቅለኝ ቆይ ብቻ ሲል ሲዝትብኝ \n" +
                        "የጌታን ሥም እጠራለሁ ከጠላቴም አድናለሁ \n" +
                        "\n" +
                        "አዝ፦ ምሥጋና የሚገባውን \n" +
                        "እግዚአብሔርን እጠራለሁ \n" +
                        "ከጠላቶቼም እድናለሁ (2x) \n" +
                        "\n" +
                        "የጌታ ኢየሱስ ሥም ለእኔ የፀና ግንብ ነውና \n" +
                        "እስከዛሬም እርሱን ጠርቶ ማንም አላፈረምና \n" +
                        "በኪሩቤል የሚኖረው ሙሉ ተስፋ ስለሰጠኝ \n" +
                        "ታምኜ ሥሙን እጠራለሁ ከጠላቴም እድናለሁ \n" +
                        "\n" +
                        "አዝ፦ ምሥጋና የሚገባውን \n" +
                        "እግዚአብሔርን እጠራለሁ \n" +
                        "ከጠላቶቼም እድናለሁ (2x) \n" +
                        "\n" +
                        "በጨነቀኝ ጊዜ ሁሉ እግዚአብሔርን ጠራሁት \n" +
                        "ስቅስቅ እያልኩኝ በእንባ የሆዴን ብሶት ነገርኩት \n" +
                        "ከዚያም በበቀል ወረደ ከሰማይ አንጐደጐደ \n" +
                        "በመብረቁ አወካቸው በፍላጻው በተናቸው \n" +
                        "\n" +
                        "አዝ፦ ምሥጋና የሚገባውን \n" +
                        "እግዚአብሔርን እጠራለሁ \n" +
                        "ከጠላቶቼም እድናለሁ (2x) \n" +
                        "\n" +
                        "ለጥርሶቻቸው ንክሻ አላደረገኝምና \n" +
                        "ከተዘረጋብኝ ወጥመድ ሁሌ አድኖኛልና \n" +
                        "አርነቴን ከሚቀማ ከሰይጣን ጋርዶኛልና \n" +
                        "ሥሙ ይክበር ሃሌሉያ እያልኩኝ ልኑር በእርሱ ጉያ \n" +
                        "\n" +
                        "አዝ፦ ምሥጋና የሚገባውን \n" +
                        "እግዚአብሔርን እጠራለሁ \n" +
                        "ከጠላቶቼም እድናለሁ (2x)";
            case 16:
                return "የጠራውን መስሎ መኖር መጋደሉን ፈርቶ \n" +
                        "የገባለትን ጣለና ተስፋውን ዘንግቶ \n" +
                        "የሙት ልጅ የነበረ ሰው ከጥፋት የዳነ \n" +
                        "የተሰዋለትን ኢየሱስ ያንን አዳኙን ከዳ \n" +
                        "\n" +
                        "አዝ፦ የባዘነውን ፋላጊ አምላክ \n" +
                        "የምህረት አምባ ለጠፉትም የምታነባ \n" +
                        "ከሕይወት ወደ ሞት ከእረፍት ወደ ጭንቀት \n" +
                        "የሄደውን መልስ እባክህ ጌታ ወደ መንጋህ በረት \n" +
                        "\n" +
                        "ተዋግቶ የማረከውን ያንን ስመ ጥሩ ጀግና \n" +
                        "ጌታውን ሊያስከብር ቆርጦ ተሰልፏልና \n" +
                        "ጠላት ከባሻገር ቆሞ ቅናት እያጋየው \n" +
                        "እሸክላውን ዘርግቶበት ወንድሜን ዘለፈው \n" +
                        "\n" +
                        "አዝ፦ የባዘነውን ፋላጊ አምላክ \n" +
                        "የምህረት አምባ ለጠፉትም የምታነባ \n" +
                        "ከሕይወት ወደ ሞት ከእረፍት ወደ ጭንቀት \n" +
                        "የሄደውን መልስ እባክህ ጌታ ወደ መንጋህ በረት \n" +
                        "\n" +
                        "በአምላኩ መቅደስ ውስጥ ሆኖ ተማምኖ እያገሳ \n" +
                        "ገናናነቱንም ሲያውጅ የይሁዳን አንበሳ \n" +
                        "እንግዳ ነገር ወሰደ ነዝንዞ ጨቅጭቆ  \n" +
                        "ፀጋ ክብሩን አስላጭቶ እጅግ አስጨንቆ \n" +
                        "\n" +
                        "አዝ፦ የባዘነውን ፋላጊ አምላክ \n" +
                        "የምህረት አምባ ለጠፉትም የምታነባ \n" +
                        "ከሕይወት ወደ ሞት ከእረፍት ወደ ጭንቀት \n" +
                        "የሄደውን መልስ እባክህ ጌታ ወደ መንጋህ በረት \n" +
                        "\n" +
                        "ጥቃቅኑ ነገር ሁሉ ጉልበቱን ከርክሮ \n" +
                        "ዜናውን እየተረከብን በህመም አደንዝዞ \n" +
                        "ያ የክህደት አውሎ በሕይወቱ ነፍቶበት \n" +
                        "ከወይኑ ግንድ ገነጠለው ፍሬ እንዳይገኝበት \n" +
                        "\n" +
                        "አዝ፦ የባዘነውን ፋላጊ አምላክ \n" +
                        "የምህረት አምባ ለጠፉትም የምታነባ \n" +
                        "ከሕይወት ወደ ሞት ከእረፍት ወደ ጭንቀት \n" +
                        "የሄደውን መልስ እባክህ ጌታ ወደ መንጋህ በረት";
            case 17:
                return "አዝ፦ ኃጢአት ሥሩን ሰዶ ሳይጠነክርብኝ \n" +
                        "ሳይታወቀኝ አድጐ ሞትን ሳይወልድብኝ \n" +
                        "ንስሃ እንደገባ በጊዜ ገስፀኝ (2x) \n" +
                        "\n" +
                        "የሌብነት ካባ ወርቁም ሆነ ብሩ \n" +
                        "ከድንኳኔ በታች ተቀብረው ሳይቀሩ \n" +
                        "ቃልህን ለመጠበቅ ልጆችህ ሲጥሩ \n" +
                        "በተደበቀ እርም ወድቀው ሲማረሩ \n" +
                        "\n" +
                        "አዝ፦ ኃጢአት ሥሩን ሰዶ ሳይጠነክርብኝ \n" +
                        "ሳይታወቀኝ አድጐ ሞትን ሳይወልድብኝ \n" +
                        "ንስሃ እንደገባ በጊዜ ገስፀኝ (2x) \n" +
                        "\n" +
                        "ኃጢአትን ታግፌ ጌታ ሆይ ብልህም \n" +
                        "ውስጤ ሳይስተካከል ብዘምርልህም \n" +
                        "ወይም ብሰብክልህ ጉድለቴን ሳላውቀው \n" +
                        "ምን ፍሬ ይገኛል በከንቱ መሮጥ ነው \n" +
                        "\n" +
                        "አዝ፦ ኃጢአት ሥሩን ሰዶ ሳይጠነክርብኝ \n" +
                        "ሳይታወቀኝ አድጐ ሞትን ሳይወልድብኝ \n" +
                        "ንስሃ እንደገባ በጊዜ ገስፀኝ (2x) \n" +
                        "\n" +
                        "ጌታ ሆይ የለኝም ከአንተ የምቀርበው \n" +
                        "ድካሜን ብርታቴን ተረድቶ የሚያውቅልኝ \n" +
                        "ስለዚህ መርምረህ ንገረኝ በደሌን \n" +
                        "ንስሃ ልግባ እኔ አዋርጄ እራሴን \n" +
                        "\n" +
                        "አዝ፦ ኃጢአት ሥሩን ሰዶ ሳይጠነክርብኝ \n" +
                        "ሳይታወቀኝ አድጐ ሞትን ሳይወልድብኝ \n" +
                        "ንስሃ እንደገባ በጊዜ ገስፀኝ (2x)";
            case 18:
                return "አየሁ (3x) አሻግሬ አየሁ \n" +
                        "አምነው የሞቱትን ልመስል ተመኘሁ \n" +
                        "\n" +
                        "አብርሃምን አየሁ የእግዚአብሔርን ወዳጅ \n" +
                        "ይስሐቅን ሊሰዋ ለሰይፍ የሚያዘጋጅ \n" +
                        "ቃሉን ያከበረ ያን ቁም ነገረኛ \n" +
                        "በሀሳቡም ቁርጠኛ የእምነትን አርበኛ \n" +
                        "ስውር ጣዖት የለውም ከአምላኩ የሚነጥል \n" +
                        "በቀውጢ ዘመናት እምነቱን የሚያስቀር \n" +
                        "\n" +
                        "ሐዋርያትን አየሁ የፍቅር ሰልፈኞች \n" +
                        "የኃጢአትን ጠሮት የእምነትን ቀንድኞች \n" +
                        "በአንድነት በመሆን ምድርን ነቀነቋት \n" +
                        "በብርሃን ወንጌል ባንዴ አጥለቀለቋት \n" +
                        "ከጌቶቹ ጌታ ፈቃድ ነበራቸው \n" +
                        "ሥልጣናት አልቻሉም ሊያግቷቸው \n" +
                        "\n" +
                        "ሰማዕታትን አየሁ እነ እስጢፋኖስን \n" +
                        "ዓለም ስጥላቸው አምነው ኢየሱስን \n" +
                        "የደም ጥማተኞች ጡጫ ሲያሳዯዋቸው \n" +
                        "ፊታቸው ሲያበራ ያንሳ በእግራቸው \n" +
                        "ለዓለም ሲያማልዱ ልክ እንደ ጌታቸው \n" +
                        "አቤት ሲያስቀና ያ አሟሟታቸው \n" +
                        "\n" +
                        "ኮብላዮችን አየሁ በጨለማ ገብተው \n" +
                        "ሲዖልና ሰይጣን ጌታም የለም ብለው \n" +
                        "በሥሙ ዘብተው በደሙ ቀልደው \n" +
                        "የለም ካሉት ጋራ በሞት ተገናኝተው \n" +
                        "መንፈሴ አያቸው በአንድነት ሲንጫጩ \n" +
                        "በሙታን ዓለም ውስጥ በእሳት ሲወራጩ \n" +
                        "\n" +
                        "እንግዲህ ጌታ ሆይ እኔነቴን ግዛ \n" +
                        "ኪዳኔን አጥብቄ ሞትን እንዳልገዛ \n" +
                        "ብርሃኑ ደብዝዞ ጭጋጉ ሲከበኝ \n" +
                        "አንተው እየመራህ ወደ ላይ አዝልቀኝ \n" +
                        "የተፃፈው ሁሉ ለትምህርት ሆኖልኝ \n" +
                        "በፅናት ታግዬ እንዳልፍ እርዳኝ \n" +
                        "የተጻፈው ሁሉ ለትምህርት ሆኖልኝ \n" +
                        "ገድሉን ተጋድዬ እንዳልፍ እርዳኝ";
            case 19:
                return "አዝ፦ ኢየሱስን እንደ ሰው አትጠራጠረው \n" +
                        "መዋሸት አያውቅም ተስፋህን ጠብቀው \n" +
                        "አይጥልህምና በመከራ ጥራው \n" +
                        "አፍህ አያመነው በልብህ አትግታው \n" +
                        "\n" +
                        "ከጠላት ፍላፃ ከሰይፍ ያድንሃል \n" +
                        "በረህብም ዘመን ከሞት ያስጥልሃል \n" +
                        "ስሙን ያስከብራል ቁም ነገርን ያውቃል \n" +
                        "ሕጻን ስላይደለ ያለውን ይፈጽማል \n" +
                        "\n" +
                        "አዝ፦ ኢየሱስን እንደ ሰው አትጠራጠረው \n" +
                        "መዋሸት አያውቅም ተስፋህን ጠብቀው \n" +
                        "አይጥልህምና በመከራ ጥራው \n" +
                        "አፍህ አያመነው በልብህ አትግታው \n" +
                        "\n" +
                        "በታማንነቱ ተው ገደብ አትስጠው \n" +
                        "ለወላዋይነትህ ፅና . (1) . \n" +
                        "የዘለዓለም አምላክ እግዚአብሔር አይዋሽም \n" +
                        "የገባልህን ቃል ፈፅሞ አይክድም \n" +
                        "\n" +
                        "አዝ፦ ኢየሱስን እንደ ሰው አትጠራጠረው \n" +
                        "መዋሸት አያውቅም ተስፋህን ጠብቀው \n" +
                        "አይጥልህምና በመከራ ጥራው \n" +
                        "አፍህ አያመነው በልብህ አትግታው \n" +
                        "\n" +
                        "ከእርሱ ጋር እስከሆንክ ከአንተ ጋራ ነው \n" +
                        "አውጥቶ እንዳይጥልህ ብቻ አትተወው \n" +
                        "አስብ ቆም ብለህ ያሳለፍከውን ዘመን \n" +
                        "ዛሬም አምነህ ጥራ ያኔ ያዳነህን \n" +
                        "\n" +
                        "አዝ፦ ኢየሱስን እንደ ሰው አትጠራጠረው \n" +
                        "መዋሸት አያውቅም ተስፋህን ጠብቀው \n" +
                        "አይጥልህምና በመከራ ጥራው \n" +
                        "አፍህ አያመነው በልብህ አትግታው \n" +
                        "\n" +
                        "ግሁድ እየጠራህ ድምፅን አምልጠሃል \n" +
                        "ለስንቱስ አለቃ ስንት ጊዜ ድነሃል \n" +
                        "ውለታውን ሲረሱ ጌታ ቅር ይለዋል \n" +
                        "በቃሉ ብታምን ሁሉ ይቻልሃል \n" +
                        "\n" +
                        "አዝ፦ ኢየሱስን እንደ ሰው አትጠራጠረው \n" +
                        "መዋሸት አያውቅም ተስፋህን ጠብቀው \n" +
                        "አይጥልህምና በመከራ ጥራው \n" +
                        "አፍህ አያመነው በልብህ አትግታው";
            case 20:
                return "ጌቴ ኢየሱስ የእኔ ቤዛ \n" +
                        "ጉስቁልናዬ ቢበዛ \n" +
                        "ከክብሩ ተዋረደልኝ \n" +
                        "በእኔ ፈንታ ታረደልኝ (2x) \n" +
                        "\n" +
                        "አዝ፦ የእኔ ጌታ ስለ እኔ ገዶት \n" +
                        "ኃጢአቴም አስጨንቆት \n" +
                        "ዝም ብሎ እንደ ጠቦት \n" +
                        "በሀሰት ተመስክሮበት በችሎት \n" +
                        "ዕዳዬን ከፍሎታል ተሰቅሎ በመሀል \n" +
                        "\n" +
                        "ግብዝ አይደል እንደ ሰው \n" +
                        "ወረት ጨርሶ ያልነካው \n" +
                        "በጐልጐታ ላይ የታየው \n" +
                        "እውነትም እርሱ ፍቅር ነው (2x) \n" +
                        "\n" +
                        "አዝ፦ የእኔ ጌታ ስለ እኔ ገዶት \n" +
                        "ኃጢአቴም አስጨንቆት \n" +
                        "ዝም ብሎ እንደ ጠቦት \n" +
                        "በሀሰት ተመስክሮበት በችሎት \n" +
                        "ዕዳዬን ከፍሎታል ተሰቅሎ በመሀል \n" +
                        "\n" +
                        "ያጀቡት ሁሉ ፈርጥጠው \n" +
                        "ለሰይፍ ለጐመድ አጋልጠው \n" +
                        "በዚያን ምሽት አልቦታል \n" +
                        "ቃቶ ነፍሴን ታድጓታል (2x) \n" +
                        "\n" +
                        "አዝ፦ የእኔ ጌታ ስለ እኔ ገዶት \n" +
                        "ኃጢአቴም አስጨንቆት \n" +
                        "ዝም ብሎ እንደ ጠቦት \n" +
                        "በሀሰት ተመስክሮበት በችሎት \n" +
                        "ዕዳዬን ከፍሎታል ተሰቅሎ በመሀል \n" +
                        "\n" +
                        "በግፍ ጀርባው ተላልጦ \n" +
                        "እግሩንም ለስቃይ ገልጦ \n" +
                        "ንጹስህ ደሙን ለእኔ ከፍሎ \n" +
                        "በቀራንዮ ደርቆ ውሎ (2x) \n" +
                        "\n" +
                        "አዝ፦ የእኔ ጌታ ስለ እኔ ገዶት \n" +
                        "ኃጢአቴም አስጨንቆት \n" +
                        "ዝም ብሎ እንደ ጠቦት \n" +
                        "በሀሰት ተመስክሮበት በችሎት \n" +
                        "ዕዳዬን ከፍሎታል ተሰቅሎ በመሀል \n" +
                        "\n" +
                        "ይህ ፍቅር በሕይወቴ ገብቶ \n" +
                        "የደህንነት ሥራ ሰርቶ \n" +
                        "ቆሻሻነቴን ቀይሮ \n" +
                        "አይቻለሁኝ ውብ ኑሮ (2x) \n" +
                        "\n" +
                        "አዝ፦ የእኔ ጌታ ስለ እኔ ገዶት \n" +
                        "ኃጢአቴም አስጨንቆት \n" +
                        "ዝም ብሎ እንደ ጠቦት \n" +
                        "በሀሰት ተመስክሮበት በችሎት \n" +
                        "ዕዳዬን ከፍሎታል ተሰቅሎ በመሀል";
            case 21:
                return "አዝ፦ እንዘምራለን (2x) በጊዜውም አለጊዜውም \n" +
                        "በሕይወታችን ዘመን ሁሉ ጌታን እናከብራለን \n" +
                        "\n" +
                        "ዘምሩለት ለአምላካችን ዘምሩ ዘምሩለት ንጉሣችን \n" +
                        "ዘምሩ እግዚአብሔር በምድር ሁሉ ንጉሥ ነውና \n" +
                        "በማስተዋል ዘምሩ \n" +
                        "\n" +
                        "አዝ፦ እንዘምራለን (2x) በጊዜውም አለጊዜውም \n" +
                        "በሕይወታችን ዘመን ሁሉ ጌታን እናከብራለን (2x) \n" +
                        "ጌታን እናከብራለን (2x)";
            case 22:
                return "በአምላክ አምሳል ተፈጥሬ በጐ ለማድረግ በፊቱ \n" +
                        "ስኖር ሳለሁ ኃጥያቴ አድርጐኝ ነበር ከንቱ \n" +
                        "ክቡር ሆኜ ሳለሁ አምላኬን ረስቼ \n" +
                        "እንደሚጠፉ እንስሶች መሰልኩ \n" +
                        "\n" +
                        "እኔ ሳልፈልገው ጌታ ሊፈልገኝ ከላይ መጥቶ \n" +
                        "ከእርኩሰት ውስጥ ነጥቆ አወጣኝ በዓለም ላይ ተንከራቶ \n" +
                        "ሸክሜን ወሰደልኝ በሥጋዬ ሞተልኝ \n" +
                        "የማይቆጠረውን በደሌን ፋቀልኝ \n" +
                        "\n" +
                        "መድኃኒቴ ነው ኢየሱሴ ጌታዬና አምላኬ \n" +
                        "ስለ መልካሙ ውለታው ላመስግነው ተንበርክኬ \n" +
                        "ምህረቱ ብዙ ነው ማዳኑ ግሩም ነው \n" +
                        "ለአምላካዊ ፍቅሩ መጨረሻ የለው \n" +
                        "\n" +
                        "በሞት ጥላ ውስጥ እያለሁ በድቅድቅ ጨለማ \n" +
                        "ኢየሱስ ብርሃኔ መጥቶ አዳነኝ መሀሪ ነውና \n" +
                        "ለፍርድ የተመደብኩ ለሲዖል የታጨሁ \n" +
                        "የቁጣ ልጅ ስሆን ከፍጥረቴ \n" +
                        "ቅጣቴን ውስዶ ያ ረድኤቴ (2x)";
            case 23:
                return "አዝ፦ እንዲህ አልነበርኩም ዛሬ ግን ሆኛለሁ \n" +
                        "ያን መልካሙን ሕይወት ከድሮ ውስጥ ፈልግያለሁ (2x) \n" +
                        "\n" +
                        "ሥምህን እንደዋዛ ተሽክሜዋለሁ \n" +
                        "ክርስቲያን ተብዬም ይኸው እጠራለሁ \n" +
                        "ውስጤ ቢመረመር ግን እንዲህ አይደለም \n" +
                        "የመንፈስ ፍሬ ከቶ በእኔ የለም \n" +
                        "\n" +
                        "አዝ፦ እንዲህ አልነበርኩም ዛሬ ግን ሆኛለሁ \n" +
                        "ያን መልካሙን ሕይወት ከድሮ ውስጥ ፈልግያለሁ (2x) \n" +
                        "\n" +
                        "የለየልኝም ከሃዲ አልሆንኩኝም \n" +
                        "ክርስቲያንም ሆኜ አልበረታሁም \n" +
                        "እንዲያው ለብ ብዬ አስቸግሬያለሁኝ \n" +
                        "ዛሬስ በንስሃ ተደፍቻለሁኝ \n" +
                        "\n" +
                        "አዝ፦ እንዲህ አልነበርኩም ዛሬ ግን ሆኛለሁ \n" +
                        "ያን መልካሙን ሕይወት ከድሮ ውስጥ ፈልግያለሁ (2x) \n" +
                        "\n" +
                        "ለክርስቲያኖች ለአንተ ያለኝ ፍቅር \n" +
                        "ላገልግልህም ሥምህን ላስከብር \n" +
                        "የነበረኝ ፀሎት ያ ሁሉ ትጋቴ \n" +
                        "እፍገመገማለሁ ከድቶኛል ብርታቴ \n" +
                        "\n" +
                        "አዝ፦ እንዲህ አልነበርኩም ዛሬ ግን ሆኛለሁ \n" +
                        "ያን መልካሙን ሕይወት ከድሮ ውስጥ ፈልግያለሁ (2x) \n" +
                        "\n" +
                        "ሽቅብ እንደመውጣት ቁልቁለት ሄጃለሁ \n" +
                        "ወደ ሞትም ደጃፍ በጣም ቀርቤያለሁ \n" +
                        "አሁንም በቃልህ ተገስጫለሁኝ \n" +
                        "ዳግም አንሳኝ ብዬ ተማጽኛለሁኝ \n" +
                        "\n" +
                        "አዝ፦ እንዲህ አልነበርኩም ዛሬ ግን ሆኛለሁ \n" +
                        "ያን መልካሙን ሕይወት ከድሮ ውስጥ ፈልግያለሁ (2x)";
            case 24:
                return "አዝ፦ ዘመኑ ፈጠነ ገሰገሰ \n" +
                        "የጌታችን መምጫ ጊዜያቱ ደረሰ \n" +
                        "ሰዎች ቶሎ በሉ መከሩን ሰብስቡ \n" +
                        "የተጣለብንን መከራ አስቡ \n" +
                        "\n" +
                        "ሰዓቱ ሊሞላ በቅርብ ነው ያለው \n" +
                        "መለከት ሊነፋ በቅርብ ነው ያለው \n" +
                        "ነገሩ ሊያከትም በቅርብ ነው ያለው \n" +
                        "ጌታም ከተፍ ሊል በቅርብ ነው ያለው \n" +
                        "\n" +
                        "አዝ፦ ዘመኑ ፈጠነ ገሰገሰ \n" +
                        "የጌታችን መምጫ ጊዜያቱ ደረሰ \n" +
                        "ሰዎች ቶሎ በሉ መከሩን ሰብስቡ \n" +
                        "የተጣለብንን መከራ አስቡ \n" +
                        "\n" +
                        "ሰማያት ሲከብዱ ደመናው ሲጠቁር \n" +
                        "ምድራችን ስታምር ነገር ሲቀያየር \n" +
                        "ምን አዚም ኖረብን እንዳናይ ጊዜ አጥሮን \n" +
                        "ተው ነቃ እንበል እናቁም አንቅልፍን \n" +
                        "\n" +
                        "አዝ፦ ዘመኑ ፈጠነ ገሰገሰ \n" +
                        "የጌታችን መምጫ ጊዜያቱ ደረሰ \n" +
                        "ሰዎች ቶሎ በሉ መከሩን ሰብስቡ \n" +
                        "የተጣለብንን መከራ አስቡ \n" +
                        "\n" +
                        "ሰው ሲተራመስ ሞትን ለመሳለም \n" +
                        "ከአምላክ ተለይቶ ለኃጢያት ሲታመን  \n" +
                        "ጠቢቡ እንኳን ሲስት በሰይጣን ሲታለለ \n" +
                        "ተነሱ አንናገር ለነፍስ እንታገል \n" +
                        "\n" +
                        "አዝ፦ ዘመኑ ፈጠነ ገሰገሰ \n" +
                        "የጌታችን መምጫ ጊዜያቱ ደረሰ \n" +
                        "ሰዎች ቶሎ በሉ መከሩን ሰብስቡ \n" +
                        "የተጣለብንን መከራ አስቡ \n" +
                        "\n" +
                        "እርሱ ያልሞተ እራሱን ያልከዳ \n" +
                        "ጌታ የማይገዛው ለኃጥያት ያልታገለ \n" +
                        "በምኑ ይመስክር ልቡ ይንቀጠቀጣል \n" +
                        "ዋጋም ክፈል ሲባል ትቶ ይፈረጥጣል \n" +
                        "\n" +
                        "አዝ፦ ዘመኑ ፈጠነ ገሰገሰ \n" +
                        "የጌታችን መምጫ ጊዜያቱ ደረሰ \n" +
                        "ሰዎች ቶሎ በሉ መከሩን ሰብስቡ \n" +
                        "የተጣለብንን መከራ አስቡ";
            case 25:
                return "አዝ፦ ኢየሱስ ኢየሱስ የነፍሴ መድኃኒት የሰላሙ ንጉሥ \n" +
                        "ኢየሱስ ኢየሱስ ና ሕይወቴን ፈውስ \n" +
                        "\n" +
                        "ወደ እኔ ጩህ እኔም እመልሳለሁ \n" +
                        "ታላቁንም ነገር ለአንተ አሳይሃለሁ \n" +
                        "በቃልህ ስላልከኝ እንዲህ እጮሃለሁ \n" +
                        "እንድትፈውሰኝ ሥምህን ጠራለሁ \n" +
                        "\n" +
                        "አዝ፦ ኢየሱስ ኢየሱስ የነፍሴ መድኃኒት የሰላሙ ንጉሥ \n" +
                        "ኢየሱስ ኢየሱስ ና ሕይወቴን ፈውስ \n" +
                        "\n" +
                        "በድካም ማዕበል ሕይወቴ ተከፍቶ \n" +
                        "በሚሰብር በትር ክፉኛ ተመቶ \n" +
                        "የታመቀው ስቃይ ልብን እየጣሰ \n" +
                        "እንባን አስክትሎ ወደ አንተ ደረሰ \n" +
                        "\n" +
                        "አዝ፦ ኢየሱስ ኢየሱስ የነፍሴ መድኃኒት የሰላሙ ንጉሥ \n" +
                        "ኢየሱስ ኢየሱስ ና ሕይወቴን ፈውስ \n" +
                        "\n" +
                        "አልጥልህም ብለህ ከቶም አለቅህም \n" +
                        "የገባህልኝ ቃል አልተዘነጋኝም \n" +
                        "እኔ ፈዋሽህ ነኝ ብለህ የፈወስከኝ \n" +
                        "ከጉስቁልናዬ ና ዛሬም አድነኝ \n" +
                        "\n" +
                        "አዝ፦ ኢየሱስ ኢየሱስ የነፍሴ መድኃኒት የሰላሙ ንጉሥ \n" +
                        "ኢየሱስ ኢየሱስ ና ሕይወቴን ፈውስ \n" +
                        "\n" +
                        "ሰባራውን ጠጋኝ የፈረሰውን አዳሽ \n" +
                        "ፈዋሽ አንተ ነህ የእንባዬ አባሽ \n" +
                        "ሰዎች ያላዩትን ቁስሌን ያየህልኝ \n" +
                        "አንተ ብቻ እኮ ነህ ዛሬም ያለህልኝ \n" +
                        "\n" +
                        "አዝ፦ ኢየሱስ ኢየሱስ የነፍሴ መድኃኒት የሰላሙ ንጉሥ \n" +
                        "ኢየሱስ ኢየሱስ ና ሕይወቴን ፈውስ";
            case 26:
                return "አዝ፦ ልብህ ጽኑ ይሁን አይላላ ጠንክር \n" +
                        "በአመንክበት ጌታ በፍፁም አትፈር (2x) \n" +
                        "\n" +
                        "ተድላና ደስታ መጽናናት በረከት \n" +
                        "ሁሌ መንደላቀቅ በተሟላ ሕይወት \n" +
                        "እንደዚህ አይደለም እንዲህ አትመልከት \n" +
                        "ክርስትና አንዳንዴ መከራም አለበት \n" +
                        "\n" +
                        "አዝ፦ ልብህ ጽኑ ይሁን አይላላ ጠንክር \n" +
                        "በአመንክበት ጌታ በፍፁም አትፈር (2x) \n" +
                        "\n" +
                        "የጨለማው ስልጣን ጥላውን ዘርግቶ \n" +
                        "ጠላት ኃይሉን ሲያሳይ እጅግ ተቆጥቶ \n" +
                        "በበትር ሲመጣ በቁጣ ሲያጠቃ \n" +
                        "ከመስቀሉ ወንድሜ አይጥፋ \n" +
                        "\n" +
                        "አዝ፦ ልብህ ጽኑ ይሁን አይላላ ጠንክር \n" +
                        "በአመንክበት ጌታ በፍፁም አትፈር (2x) \n" +
                        "\n" +
                        "ማምለጫ ስታሻ ቀዳዳ ስትፈልግ \n" +
                        "ጭላንጭል ውስጥ እንኳን ሲደፈን ሲመረግ \n" +
                        "በወህኒ ተጥለህ ሰው ሁሉ ሲረሳህ \n" +
                        "የሕይወትህ ጌታ የሚረሳህ አይምሰልህ \n" +
                        "\n" +
                        "አዝ፦ ልብህ ጽኑ ይሁን አይላላ ጠንክር \n" +
                        "በአመንክበት ጌታ በፍፁም አትፈር (2x) \n" +
                        "\n" +
                        "በምስራቹ ቃል በወንጌል ተሟገት \n" +
                        "ልብህ ሰፊ ይሁን አርቀህ ተመልከት \n" +
                        "ለማያልፈው እርስት ለአገርህ ተዋግተህ \n" +
                        "በላይ እንገናኝ ዘመንህን አጥለቅልቀህ \n" +
                        "\n" +
                        "አዝ፦ ልብህ ጽኑ ይሁን አይላላ ጠንክር \n" +
                        "በአመንክበት ጌታ በፍፁም አትፈር (2x)";
            case 27:
                return "የሚቀጠቅጥ በአንተ ላይ ወጥቷል በጠላት ተከበሃል \n" +
                        "ክርስቲያን ተጠንቀቅ ዙሪያህን አስተውል \n" +
                        "ጉልበትህ አይላላ ጠንክረህ ተዋጋ \n" +
                        "ብድራትን አይተህ ያለልህን ኋላ \n" +
                        "\n" +
                        "አዝ፦ ኢየሱስን ለብሰህ \n" +
                        "የጦር ዕቃህን አንስተህ \n" +
                        "በእርሱ መልካም ጦርነት ተዋጋ \n" +
                        "ኢየሱስ ያሸንፋል ለድሉ አትስጋ \n" +
                        "\n" +
                        "በጦርነት ላይ መቁሰልም አለ ሞትም ቢሆን ጥቅም ነው \n" +
                        "ለጨለማው ገዢ እጅህን አትስጠው \n" +
                        "እስከ ሞትህ ታመን ነፍስህን አታክብራት \n" +
                        "ለታመነው ፈጣሪ አሳልፈህ ስጣት \n" +
                        "\n" +
                        "አዝ፦ ኢየሱስን ለብሰህ \n" +
                        "የጦር ዕቃህን አንስተህ \n" +
                        "በእርሱ መልካም ጦርነት ተዋጋ \n" +
                        "ኢየሱስ ያሸንፋል ለድሉ አትስጋ \n" +
                        "\n" +
                        "ባለጋራህ ዲያብሎስ ሊውጥህ እያገሳብህ ነውና \n" +
                        "በድምፁ አትፍራ አባትህ አለና \n" +
                        "መንጋጋውን ዘግቶ ከአፍ ያስጥልሃል \n" +
                        "ከቶም እንደማይጥልህ በግልጽ ያሳይሃል \n" +
                        "\n" +
                        "አዝ፦ ኢየሱስን ለብሰህ \n" +
                        "የጦር ዕቃህን አንስተህ \n" +
                        "በእርሱ መልካም ጦርነት ተዋጋ \n" +
                        "ኢየሱስ ያሸንፋል ለድሉ አትስጋ \n" +
                        "\n" +
                        "የውጊያው ጊዜ አሁን ነው ወንድም \n" +
                        "ተነስ ተጋጠመው ድል ትነሳለህ \n" +
                        "በርትተህ ታገለው የአብርሃም አምላክ ጋሻ ይሆንሃል \n" +
                        "ለአገርህም አብቅቶ አክሊል ይሰጥሃል \n" +
                        "\n" +
                        "አዝ፦ ኢየሱስን ለብሰህ \n" +
                        "የጦር ዕቃህን አንስተህ \n" +
                        "በእርሱ መልካም ጦርነት ተዋጋ \n" +
                        "ኢየሱስ ያሸንፋል ለድሉ አትስጋ";
            case 28:
                return "አዝ፦ እስከዛሬ የጠበከን \n" +
                        "ከፍላጻ የሸፈንከን \n" +
                        "ዳርቻችንንም ያሰፋህልን \n" +
                        "እንባችንን ና አብስልን \n" +
                        "\n" +
                        "በማይገለጸው ክብርህ \n" +
                        "በማይካድ ጉልበትህ \n" +
                        "አንድነትን አሳየን \n" +
                        "ለእኛም ከለላ የሆንህ \n" +
                        "\n" +
                        "አዝ፦ እስከዛሬ የጠበከን \n" +
                        "ከፍላጻ የሸፈንከን \n" +
                        "ዳርቻችንንም ያሰፋህልን \n" +
                        "እንባችንን ና አብስልን \n" +
                        "\n" +
                        "የጠላትን ቁጣ አይተን \n" +
                        "ልካችንን ስንመስል \n" +
                        "ተስፋ ቆርጠን ወየው ስንል \n" +
                        "አማኑኤል ደረስክልን \n" +
                        "\n" +
                        "አዝ፦ እስከዛሬ የጠበከን \n" +
                        "ከፍላጻ የሸፈንከን \n" +
                        "ዳርቻችንንም ያሰፋህልን \n" +
                        "እንባችንን ና አብስልን \n" +
                        "\n" +
                        "በማባበል ሊያስማማን \n" +
                        "ካልተሳካው ሊያስፈራራን \n" +
                        "ጠላት ሲዝት ሲያሽካካብን \n" +
                        "ሴራውን ያከሸፍክልን \n" +
                        "\n" +
                        "አዝ፦ እስከዛሬ የጠበከን \n" +
                        "ከፍላጻ የሸፈንከን \n" +
                        "ዳርቻችንንም ያሰፋህልን \n" +
                        "እንባችንን ና አብስልን \n" +
                        "\n" +
                        "ድብልቅ ኑሮ ያልኖረ \n" +
                        "ከእግዚአብሔርም የተማረ \n" +
                        "ቢማቅቅም ያሸንፋል \n" +
                        "የአምላኩንም ሥም ያስጠራል \n" +
                        "\n" +
                        "አዝ፦ እስከዛሬ የጠበከን \n" +
                        "ከፍላጻ የሸፈንከን \n" +
                        "ዳርቻችንንም ያሰፋህልን \n" +
                        "እንባችንን ና አብስልን";
            case 29:
                return "አዝ፦ ያ ተከራታቹ ኮብላይ ወገናችን \n" +
                        "መቷል እንደገና እሰይ ደስ ይበለን \n" +
                        "ያ ተከራታቹ ኮብላይ ወገናችን \n" +
                        "መቷል እንደገና እሰይ ደስ ይበለን (2x) \n" +
                        "\n" +
                        "በመዳኑ ምክንያት መላዕክት ፈንጭተው \n" +
                        "በአገልግሎቱም ብዙ ሰዎች ረክተው \n" +
                        "ያንን ሰው በቃሉ እንቅፋት እግኝቶት \n" +
                        "ወድቆ የነበረው አዳኙንም ከድቶ \n" +
                        "\n" +
                        "አዝ፦ ያ ተከራታቹ ኮብላይ ወገናችን \n" +
                        "መቷል እንደገና እሰይ ደስ ይበለን \n" +
                        "ያ ተከራታቹ ኮብላይ ወገናችን \n" +
                        "መቷል እንደገና እሰይ ደስ ይበለን (2x) \n" +
                        "\n" +
                        "መርዶውን እየሰሙ ሰዎች አልቅሰውለት \n" +
                        "ጌታ እንዲያስነሳው ከልብ ጸልየውለት \n" +
                        "በመራራ ጩሕ ት ለአምላኩ ነግረውለት \n" +
                        "መልሶ እምጥቶታል እግዚአብሔር አዝኖለት \n" +
                        "\n" +
                        "አዝ፦ ያ ተከራታቹ ኮብላይ ወገናችን \n" +
                        "መቷል እንደገና እሰይ ደስ ይበለን \n" +
                        "ያ ተከራታቹ ኮብላይ ወገናችን \n" +
                        "መቷል እንደገና እሰይ ደስ ይበለን (2x) \n" +
                        "\n" +
                        "የውድቀቱን ምክንያት ነግሮ አስጠንቅቆታል \n" +
                        "ወንድሞቹ ቀድሞ ጌታ አምጥቶለታል \n" +
                        "ተስፋን እየናቀም በወጥመድ ቢገባም \n" +
                        "ጌታ ቸር ነውና አይጨክንበትም \n" +
                        "\n" +
                        "አዝ፦ ያ ተከራታቹ ኮብላይ ወገናችን \n" +
                        "መቷል እንደገና እሰይ ደስ ይበለን \n" +
                        "ያ ተከራታቹ ኮብላይ ወገናችን \n" +
                        "መቷል እንደገና እሰይ ደስ ይበለን (2x) \n" +
                        "\n" +
                        "ያን ጨካኝ አንበሳ በግልጽ አስፍሮ \n" +
                        "በብረቱ በትር መንጋጋውን ሰብሮ \n" +
                        "ዳግም አምጥቶታል እግዚአብሔር ይመስገን \n" +
                        "ሙሾው ተለውጧል እሰይ ደስ ይበለን \n" +
                        "\n" +
                        "አዝ፦ ያ ተከራታቹ ኮብላይ ወገናችን \n" +
                        "መቷል እንደገና እሰይ ደስ ይበለን \n" +
                        "ያ ተከራታቹ ኮብላይ ወገናችን \n" +
                        "መቷል እንደገና እሰይ ደስ ይበለን (2x)";
            case 30:
                return "አዝ፦ በእውነት አሳድገን ጌታ ሆይ በፍቅር \n" +
                        "በከንቱ መታበያችን ይቅር \n" +
                        "በእውነት አሳድገን ጌታ ሆይ በፍቅር \n" +
                        "\n" +
                        "በክርስትናችን ዕድሜ ቆጥረን \n" +
                        "በልምምዳችን ኮርተን \n" +
                        "በትህትና መማሩ ቀረና \n" +
                        "እድገታችን ቆመ ታበየና \n" +
                        "\n" +
                        "አዝ፦ በእውነት አሳድገን ጌታ ሆይ በፍቅር \n" +
                        "በከንቱ መታበያችን ይቅር \n" +
                        "በእውነት አሳድገን ጌታ ሆይ በፍቅር \n" +
                        "\n" +
                        "ባስተያየታችን ጠቢባን ነን \n" +
                        "ትንኝን እናጠራለን \n" +
                        "ራሳችንን ማንጻት ሳይቻለን \n" +
                        "የሌላውን ጉድፍ እናያለን \n" +
                        "\n" +
                        "አዝ፦ በእውነት አሳድገን ጌታ ሆይ በፍቅር \n" +
                        "በከንቱ መታበያችን ይቅር \n" +
                        "በእውነት አሳድገን ጌታ ሆይ በፍቅር \n" +
                        "\n" +
                        "ማደጋችንን እዩልን እያልን \n" +
                        "በከንቱም እየታበይን \n" +
                        "አንተንም በዚህ እያሳዘንን \n" +
                        "ሳይታወቀን ስንቶችን ጐዳን \n" +
                        "\n" +
                        "አዝ፦ በእውነት አሳድገን ጌታ ሆይ በፍቅር \n" +
                        "በከንቱ መታበያችን ይቅር \n" +
                        "በእውነት አሳድገን ጌታ ሆይ በፍቅር \n" +
                        "\n" +
                        "እንደ ሕጻናት የዋሆች አርገን \n" +
                        "ንጹህ ልብን መልስልን \n" +
                        "ዓይናችንን እየገለጥህ \n" +
                        "አንተው አመላልሰን በብርሃንህ \n" +
                        "\n" +
                        "አዝ፦ በእውነት አሳድገን ጌታ ሆይ በፍቅር \n" +
                        "በከንቱ መታበያችን ይቅር \n" +
                        "በእውነት አሳድገን ጌታ ሆይ በፍቅር \n" +
                        "\n" +
                        "በቃል በስርአት ትሁታን ሆነን \n" +
                        "በፍቅር እየታነፅን \n" +
                        "በእውነት እንደግ ወደ ኢየሱስ \n" +
                        "እየታበይን እንደምን እንነስ \n" +
                        "\n" +
                        "አዝ፦ በእውነት አሳድገን ጌታ ሆይ በፍቅር \n" +
                        "በከንቱ መታበያችን ይቅር \n" +
                        "በእውነት አሳድገን ጌታ ሆይ በፍቅር";
            case 31:
                return "አዝ፦ በክቡር ደሙ ተዋጅተን \n" +
                        "የእጁ ብጐች የሆንን \n" +
                        "ሥሙን ከፍ እያደረግን ጌታችንን እናምልከው \n" +
                        "በደስታ እየዘመርን በዕልልታ እናንግሰው \n" +
                        "\n" +
                        "በእግዚአብሔር ፊት ተንበርክከን \n" +
                        "ነውር የሌለበትን መስዕዋት አቅርበን \n" +
                        "በእርሱ ባደረገ በፈጠረን \n" +
                        "በአምላካችን እጅግ ደስ ይበለን (2x) \n" +
                        "\n" +
                        "አዝ፦ በክቡር ደሙ ተዋጅተን \n" +
                        "የእጁ ብጐች የሆንን \n" +
                        "ሥሙን ከፍ እያደረግን ጌታችንን እናምልከው \n" +
                        "በደስታ እየዘመርን በዕልልታ እናንግሰው \n" +
                        "\n" +
                        "ጌታ ስናመልከው ደስ ይለዋል \n" +
                        "ስናመሰግነው ክብሩ ይጋርደናል \n" +
                        "እህል ውኃችን ይባረካል \n" +
                        "ለበሽታችንም ፈውስ ይሆናል (2x) \n" +
                        "\n" +
                        "አዝ፦ በክቡር ደሙ ተዋጅተን \n" +
                        "የእጁ ብጐች የሆንን \n" +
                        "ሥሙን ከፍ እያደረግን ጌታችንን እናምልከው \n" +
                        "በደስታ እየዘመርን በዕልልታ እናንግሰው \n" +
                        "\n" +
                        "ሩጫን አብዝተናል ያለመጠን \n" +
                        "ነፍሳችን ደረቀች አምልኮ አስቅርተን \n" +
                        "እንድንለመልም አቆጥቁጠን \n" +
                        "ጌታንን እናምልከው አስቀድመን (2x) \n" +
                        "\n" +
                        "አዝ፦ በክቡር ደሙ ተዋጅተን \n" +
                        "የእጁ ብጐች የሆንን \n" +
                        "ሥሙን ከፍ እያደረግን ጌታችንን እናምልከው \n" +
                        "በደስታ እየዘመርን በዕልልታ እናንግሰው";
            case 32:
                return "ለህዝቡ ሁሉ የሚሆን \n" +
                        "የምሥራች ተነገረ \n" +
                        "ታላቅ ደስታ ነው ልደቱ \n" +
                        "ይዘምር እስኪ ፍጥረቱ \n" +
                        "\n" +
                        "አዝ፦ መጣልን (መጣልን) \n" +
                        "ጌታ ሊጐበኘን (ሊጐበኘን) \n" +
                        "ቤዛ ሊሆንልን \n" +
                        "ከኃጢያት እኛኑ ሊያድን \n" +
                        "ቃል ሥጋ ሆነና ከድንግል ተወለደልን \n" +
                        "\n" +
                        "ህጻን ተወለደ ለእኛ \n" +
                        "በቤተልሔም በረት ተኛ \n" +
                        "ለኃጥያተኞች መዳኛ \n" +
                        "ሊሆን የበጐች እረኛ \n" +
                        "\n" +
                        "አዝ፦ መጣልን (መጣልን) \n" +
                        "ጌታ ሊጐበኘን (ሊጐበኘን) \n" +
                        "ቤዛ ሊሆንልን \n" +
                        "ከኃጢያት እኛኑ ሊያድን \n" +
                        "ቃል ሥጋ ሆነና ከድንግል ተወለደልን \n" +
                        "\n" +
                        "ሥሙ የተመሰገነ \n" +
                        "ክርስቶስ ጌታ የሆነ \n" +
                        "ተገልጧልና ልዑሉ \n" +
                        "ስገዱለት ዕልል በሉ \n" +
                        "\n" +
                        "አዝ፦ መጣልን (መጣልን) \n" +
                        "ጌታ ሊጐበኘን (ሊጐበኘን) \n" +
                        "ቤዛ ሊሆንልን \n" +
                        "ከኃጢያት እኛኑ ሊያድን \n" +
                        "ቃል ሥጋ ሆነና ከድንግል ተወለደልን \n" +
                        "\n" +
                        "ተሽቀዳደሙ ኑ እዩት \n" +
                        "የሚመስልህ የለም በሉት \n" +
                        "አድንቁት እጅግ አክብሩት \n" +
                        "ይገባዋል አመስግኑት \n" +
                        "\n" +
                        "አዝ፦ መጣልን (መጣልን) \n" +
                        "ጌታ ሊጐበኘን (ሊጐበኘን) \n" +
                        "ቤዛ ሊሆንልን \n" +
                        "ከኃጢያት እኛኑ ሊያድን \n" +
                        "ቃል ሥጋ ሆነና ከድንግል ተወለደልን \n" +
                        "\n" +
                        "በላይ ለእግዚአብሔር ክብር \n" +
                        "ለእኛም ሰላም በምድር \n" +
                        "ይሁን ብለን እንዘምር \n" +
                        "እረፍት አለ መስቀሉ ስር \n" +
                        "\n" +
                        "አዝ፦ መጣልን (መጣልን) \n" +
                        "ጌታ ሊጐበኘን (ሊጐበኘን) \n" +
                        "ቤዛ ሊሆንልን \n" +
                        "ከኃጢያት እኛኑ ሊያድን \n" +
                        "ቃል ሥጋ ሆነና ከድንግል ተወለደልን";
            case 33:
                return "ልከፍለው የማልችል ነበረብኝ ዕዳ \n" +
                        "ችግሬን ባዋየው ማን እኔን ሊረዳ \n" +
                        "ኃጥያተኛ ብሎኝ ሁሉም ተጸየፈኝ \n" +
                        "እንዲፈረድብኝ ጠላትም ከሰሰኝ (2x) \n" +
                        "\n" +
                        "ማነው የሚያድነኝ ከእንግዲህ ብዬ \n" +
                        "ብቻዬን ሳለቅስ አገኘኝ ጌታዬ \n" +
                        "ዕዳዬን ተወልኝ እንባዬን አበሰው \n" +
                        "የሕይወቴን ቁስል በቁስሉ ፈወሰው (2x) \n" +
                        "\n" +
                        "ብዙ ኃጥያቴ ተሰርዮልኛል \n" +
                        "አብዝቼ እንድወደው በእርግጥ ይገባኛል \n" +
                        "ዋጋው የከበረ የሽቶ መስዋዕት \n" +
                        "ከደስታ እንባ ጋር ምነው ባቀርብለት (2x) \n" +
                        "\n" +
                        "ለቅሶዬን ለደስታ እርሱ ከለወጠው \n" +
                        "ሽቶ ላፈስለት ብልቃጡን ብሰብረው \n" +
                        "ማነው ቅር የሚሰኝ ጌታዬን ባከብረው \n" +
                        "ሃብቴን ብቻ ሳይሆን ሕይወቴን ብሰጠው (2x) \n" +
                        "\n" +
                        "ማንም በውድቀቴ ያላዘነልኝን \n" +
                        "በምድር ላይ ፍፁም ተስፋ የሌለኝ \n" +
                        "ሞቴን ወደ ሕይወት መለሰው ኢየሱስ \n" +
                        "ስለፍቅርድ ብዛት ሥምህን ልቀድስ (2x) \n" +
                        "\n" +
                        "ማን እንዳንተ ጌታ ልብን ሊመረምር \n" +
                        "ማን ጠልቆ ሊረዳ የሰዎችን ችግር \n" +
                        "ዕውቀትህ የላቀ መሃሪዬ ነህ \n" +
                        "ምሥጋናና ክብር ይሁን ለሥምህ \n" +
                        "ይሁን ለሥምህ (2x) \n" +
                        "\n" +
                        "ይሁን ለሥምህ (2x)";


            default:
                return "No lyrics available";
        }
    }

    public void TextIncrease() {
        float currentSize = lyricsTextView.getTextSize() / getResources().getDisplayMetrics().scaledDensity;
        lyricsTextView.setTextSize(currentSize + 1);
    }

    public void TextDecrease() {
        float currentSize = lyricsTextView.getTextSize() / getResources().getDisplayMetrics().scaledDensity;
        if (currentSize > 1) { // Prevent text size from becoming too small
            lyricsTextView.setTextSize(currentSize - 1);
        }
    }
}